проект настроен на vagrant поэтому если server другой то нужно изменить файл env
------------------------------------------------

1)Зайти в папку фронденд и запустить в консоле команду - npm install
2)найти файл /frontend/keys/keys.js и вписать туда домен backend сайта
Зайти в папку фронденд и запустить в консоле команду - yarn dev

------------------------------------------------------

зайти в проект laravel и в корне запустить команду - composer install
зайти в проект laravel и в корне запустить команду - php artisan storage:link
зайти в проект laravel и в корне запустить миграции